---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.Erase(Autodesk.Revit.DB.PanelType)
source: html/b4324cab-1ffa-e109-322c-dc6ff7eb456a.htm
---
# Autodesk.Revit.DB.PanelTypeSet.Erase Method

Removes a specified panel type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	PanelType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PanelType`) - The panel type to be erased.

## Returns
The number of panel types that were erased from the set.